export function isValidEAN13(code) {
  if (code.length !== 13 || !/^\d{13}$/.test(code)) return false;
  const sum = code
    .slice(0, 12) //ตำแหน่งที่ 0 ถึงตำแหน่งที่ 11  (จะไม่เอาตำแหน่งที่ 12 ตาม 0,12)
    .split("")
    .reduce((acc, d, i) => acc + parseInt(d, 10) * (i % 2 === 0 ? 1 : 3), 0);
  const checksum = (10 - (sum % 10)) % 10; // เช็๕ว่าผลรวมของเลข 12 หลักตามสูตรคำนวน เท่ากับเลขหลักที่ 13 ไหม
  return checksum === parseInt(code[12], 10);
  //checksum === parseInt(code[12], 10); 12 หลัก ให้แปลงเป็นเลขฐาน 10
}

// ทำไมต้องทำแบบนี้?
// เพราะมันคือมาตรฐานของ EAN-13 (International Article Number)
// 3 หลักแรกรหัสประเทศ 4-8 รหัสผู้ผลิตใช้ระบุเจ้าของสินค้า 9-12 รหัสสินค้า ระบุขนาดน้ำหนักแล้วแต่ผู้ผลิต หลักที่ 13 ไว้เช็คว่าบาร์โค๊ดถูกรึป่าว
// → เอาไว้ตรวจจับ error ที่เกิดจาก:
// พิมพ์ผิดตัวเดียว
// สลับตำแหน่งเลขสองตัว
// ตัวอย่างจริง
// สมมติ barcode = 4006381333931
// เอา 12 หลักแรก → 400638133393
// คำนวณ:

// (4×1) + (0×3) + (0×1) + (6×3) + (3×1) + (8×3)

// (1×1) + (3×3) + (3×1) + (3×3) + (9×1) + (3×3)
// = 100
// 100 % 10 = 0
// check digit = (10 - 0) % 10 = 0

// แต่เลขจริงหลักที่ 13 ของ barcode นี้ = 1
// แปลว่า barcode นี้ใช้สูตรที่ต่างออกไปนิดหน่อย (บาง series อาจมีการ encode เพิ่มเติม เช่น UPC-A → EAN-13) แต่ หลักการคือ check digit มาจากการคำนวณแบบนี้
// (" /^\d{13}$/ " ) code  ต้องเป็นตัวเลข 13 หลัก เติม ! ข้างหน้าเป็นถ้าไม่ใช้ตัวเลข 13 หลัก
